app/controllers/catalog_controller.rb

  def view(id)
    @post = Post.find_by_id(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]